performance/performance.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: load-test.js
        output: -

     scenarios: (100.00%) 2 scenarios, 150 max VUs, 1m45s max duration (incl. graceful stop):
              * load_test: Up to 50 looping VUs for 50s over 3 stages (gracefulRampDown: 30s, exec: loginFlow, gracefulStop: 30s)
              * spike_test: Up to 100 looping VUs for 20s over 3 stages (gracefulRampDown: 30s, exec: loginFlow, startTime: 55s, gracefulStop: 30s)


running (0m01.0s), 000/150 VUs, 0 complete and 0 interrupted iterations
load_test    [   2% ] 00/50 VUs  01.0s/50.0s
spike_test • [   0% ] waiting    54.0s

running (0m02.0s), 001/150 VUs, 2552 complete and 0 interrupted iterations
load_test    [   4% ] 01/50 VUs  02.0s/50.0s
spike_test • [   0% ] waiting    53.0s

running (0m03.0s), 002/150 VUs, 7670 complete and 0 interrupted iterations
load_test    [   6% ] 02/50 VUs  03.0s/50.0s
spike_test • [   0% ] waiting    52.0s

running (0m04.0s), 003/150 VUs, 14673 complete and 0 interrupted iterations
load_test    [   8% ] 03/50 VUs  04.0s/50.0s
spike_test • [   0% ] waiting    51.0s

running (0m05.0s), 004/150 VUs, 23131 complete and 0 interrupted iterations
load_test    [  10% ] 04/50 VUs  05.0s/50.0s
spike_test • [   0% ] waiting    50.0s

running (0m06.0s), 005/150 VUs, 29679 complete and 0 interrupted iterations
load_test    [  12% ] 05/50 VUs  06.0s/50.0s
spike_test • [   0% ] waiting    49.0s

running (0m07.0s), 006/150 VUs, 30067 complete and 0 interrupted iterations
load_test    [  14% ] 06/50 VUs  07.0s/50.0s
spike_test • [   0% ] waiting    48.0s

running (0m08.0s), 007/150 VUs, 34461 complete and 0 interrupted iterations
load_test    [  16% ] 07/50 VUs  08.0s/50.0s
spike_test • [   0% ] waiting    47.0s

running (0m09.0s), 008/150 VUs, 43210 complete and 0 interrupted iterations
load_test    [  18% ] 08/50 VUs  09.0s/50.0s
spike_test • [   0% ] waiting    46.0s

running (0m10.0s), 009/150 VUs, 52107 complete and 0 interrupted iterations
load_test    [  20% ] 09/50 VUs  10.0s/50.0s
spike_test • [   0% ] waiting    45.0s

running (0m11.0s), 011/150 VUs, 60816 complete and 0 interrupted iterations
load_test    [  22% ] 11/50 VUs  11.0s/50.0s
spike_test • [   0% ] waiting    44.0s

running (0m12.0s), 012/150 VUs, 69785 complete and 0 interrupted iterations
load_test    [  24% ] 12/50 VUs  12.0s/50.0s
spike_test • [   0% ] waiting    43.0s

running (0m13.0s), 013/150 VUs, 75332 complete and 0 interrupted iterations
load_test    [  26% ] 13/50 VUs  13.0s/50.0s
spike_test • [   0% ] waiting    42.0s

running (0m14.0s), 015/150 VUs, 81038 complete and 0 interrupted iterations
load_test    [  28% ] 15/50 VUs  14.0s/50.0s
spike_test • [   0% ] waiting    41.0s

running (0m15.0s), 016/150 VUs, 86543 complete and 0 interrupted iterations
load_test    [  30% ] 16/50 VUs  15.0s/50.0s
spike_test • [   0% ] waiting    40.0s

running (0m16.0s), 017/150 VUs, 92137 complete and 0 interrupted iterations
load_test    [  32% ] 17/50 VUs  16.0s/50.0s
spike_test • [   0% ] waiting    39.0s

running (0m17.0s), 019/150 VUs, 97796 complete and 0 interrupted iterations
load_test    [  34% ] 19/50 VUs  17.0s/50.0s
spike_test • [   0% ] waiting    38.0s

running (0m18.0s), 020/150 VUs, 103501 complete and 0 interrupted iterations
load_test    [  36% ] 20/50 VUs  18.0s/50.0s
spike_test • [   0% ] waiting    37.0s

running (0m19.0s), 021/150 VUs, 109258 complete and 0 interrupted iterations
load_test    [  38% ] 21/50 VUs  19.0s/50.0s
spike_test • [   0% ] waiting    36.0s

running (0m20.0s), 023/150 VUs, 115132 complete and 0 interrupted iterations
load_test    [  40% ] 23/50 VUs  20.0s/50.0s
spike_test • [   0% ] waiting    35.0s

running (0m21.0s), 024/150 VUs, 121042 complete and 0 interrupted iterations
load_test    [  42% ] 24/50 VUs  21.0s/50.0s
spike_test • [   0% ] waiting    34.0s

running (0m22.0s), 025/150 VUs, 126961 complete and 0 interrupted iterations
load_test    [  44% ] 25/50 VUs  22.0s/50.0s
spike_test • [   0% ] waiting    33.0s

running (0m23.0s), 027/150 VUs, 132535 complete and 0 interrupted iterations
load_test    [  46% ] 27/50 VUs  23.0s/50.0s
spike_test • [   0% ] waiting    32.0s

running (0m24.0s), 028/150 VUs, 137783 complete and 0 interrupted iterations
load_test    [  48% ] 28/50 VUs  24.0s/50.0s
spike_test • [   0% ] waiting    31.0s

running (0m25.0s), 029/150 VUs, 141591 complete and 0 interrupted iterations
load_test    [  50% ] 29/50 VUs  25.0s/50.0s
spike_test • [   0% ] waiting    30.0s

running (0m26.0s), 031/150 VUs, 147185 complete and 0 interrupted iterations
load_test    [  52% ] 31/50 VUs  26.0s/50.0s
spike_test • [   0% ] waiting    29.0s

running (0m27.0s), 032/150 VUs, 152841 complete and 0 interrupted iterations
load_test    [  54% ] 32/50 VUs  27.0s/50.0s
spike_test • [   0% ] waiting    28.0s

running (0m28.0s), 033/150 VUs, 158609 complete and 0 interrupted iterations
load_test    [  56% ] 33/50 VUs  28.0s/50.0s
spike_test • [   0% ] waiting    27.0s

running (0m29.0s), 035/150 VUs, 164415 complete and 0 interrupted iterations
load_test    [  58% ] 35/50 VUs  29.0s/50.0s
spike_test • [   0% ] waiting    26.0s

running (0m30.0s), 036/150 VUs, 170174 complete and 0 interrupted iterations
load_test    [  60% ] 36/50 VUs  30.0s/50.0s
spike_test • [   0% ] waiting    25.0s

running (0m31.0s), 037/150 VUs, 175573 complete and 0 interrupted iterations
load_test    [  62% ] 37/50 VUs  31.0s/50.0s
spike_test • [   0% ] waiting    24.0s

running (0m32.0s), 039/150 VUs, 180919 complete and 0 interrupted iterations
load_test    [  64% ] 39/50 VUs  32.0s/50.0s
spike_test • [   0% ] waiting    23.0s

running (0m33.0s), 040/150 VUs, 186562 complete and 0 interrupted iterations
load_test    [  66% ] 40/50 VUs  33.0s/50.0s
spike_test • [   0% ] waiting    22.0s

running (0m34.0s), 041/150 VUs, 191685 complete and 0 interrupted iterations
load_test    [  68% ] 41/50 VUs  34.0s/50.0s
spike_test • [   0% ] waiting    21.0s

running (0m35.0s), 043/150 VUs, 197729 complete and 0 interrupted iterations
load_test    [  70% ] 43/50 VUs  35.0s/50.0s
spike_test • [   0% ] waiting    20.0s

running (0m36.0s), 044/150 VUs, 203531 complete and 0 interrupted iterations
load_test    [  72% ] 44/50 VUs  36.0s/50.0s
spike_test • [   0% ] waiting    19.0s

running (0m37.0s), 045/150 VUs, 209728 complete and 0 interrupted iterations
load_test    [  74% ] 45/50 VUs  37.0s/50.0s
spike_test • [   0% ] waiting    18.0s

running (0m38.0s), 047/150 VUs, 215766 complete and 0 interrupted iterations
load_test    [  76% ] 47/50 VUs  38.0s/50.0s
spike_test • [   0% ] waiting    17.0s

running (0m39.0s), 048/150 VUs, 221867 complete and 0 interrupted iterations
load_test    [  78% ] 48/50 VUs  39.0s/50.0s
spike_test • [   0% ] waiting    16.0s

running (0m40.0s), 049/150 VUs, 228270 complete and 0 interrupted iterations
load_test    [  80% ] 49/50 VUs  40.0s/50.0s
spike_test • [   0% ] waiting    15.0s

running (0m41.0s), 046/150 VUs, 234267 complete and 0 interrupted iterations
load_test    [  82% ] 46/50 VUs  41.0s/50.0s
spike_test • [   0% ] waiting    14.0s

running (0m42.0s), 041/150 VUs, 240305 complete and 0 interrupted iterations
load_test    [  84% ] 41/50 VUs  42.0s/50.0s
spike_test • [   0% ] waiting    13.0s

running (0m43.0s), 038/150 VUs, 244126 complete and 0 interrupted iterations
load_test    [  86% ] 38/50 VUs  43.0s/50.0s
spike_test • [   0% ] waiting    12.0s

running (0m44.0s), 031/150 VUs, 247665 complete and 0 interrupted iterations
load_test    [  88% ] 31/50 VUs  44.0s/50.0s
spike_test • [   0% ] waiting    11.0s

running (0m45.0s), 026/150 VUs, 254166 complete and 0 interrupted iterations
load_test    [  90% ] 26/50 VUs  45.0s/50.0s
spike_test • [   0% ] waiting    10.0s

running (0m46.0s), 021/150 VUs, 259680 complete and 0 interrupted iterations
load_test    [  92% ] 21/50 VUs  46.0s/50.0s
spike_test • [   0% ] waiting    09.0s

running (0m47.0s), 016/150 VUs, 266624 complete and 0 interrupted iterations
load_test    [  94% ] 16/50 VUs  47.0s/50.0s
spike_test • [   0% ] waiting    08.0s

running (0m48.0s), 011/150 VUs, 273679 complete and 0 interrupted iterations
load_test    [  96% ] 11/50 VUs  48.0s/50.0s
spike_test • [   0% ] waiting    07.0s

running (0m49.0s), 006/150 VUs, 280775 complete and 0 interrupted iterations
load_test    [  98% ] 06/50 VUs  49.0s/50.0s
spike_test • [   0% ] waiting    06.0s

running (0m50.0s), 001/150 VUs, 285285 complete and 0 interrupted iterations
load_test    [ 100% ] 01/50 VUs  50.0s/50.0s
spike_test • [   0% ] waiting    05.0s

running (0m51.0s), 000/150 VUs, 285316 complete and 0 interrupted iterations
load_test  ✓ [ 100% ] 00/50 VUs  50s
spike_test • [   0% ] waiting    04.0s

running (0m52.0s), 000/150 VUs, 285316 complete and 0 interrupted iterations
load_test  ✓ [ 100% ] 00/50 VUs  50s
spike_test • [   0% ] waiting    03.0s

running (0m53.0s), 000/150 VUs, 285316 complete and 0 interrupted iterations
load_test  ✓ [ 100% ] 00/50 VUs  50s
spike_test • [   0% ] waiting    02.0s

running (0m54.0s), 000/150 VUs, 285316 complete and 0 interrupted iterations
load_test  ✓ [ 100% ] 00/50 VUs  50s
spike_test • [   0% ] waiting    01.0s

running (0m55.0s), 000/150 VUs, 285316 complete and 0 interrupted iterations
load_test  ✓ [ 100% ] 00/50 VUs  50s
spike_test • [   0% ] waiting    00.0s

running (0m56.0s), 019/150 VUs, 290786 complete and 0 interrupted iterations
load_test  ✓ [ 100% ] 00/50 VUs    50s
spike_test   [   5% ] 019/100 VUs  01.0s/20.0s

running (0m57.0s), 039/150 VUs, 298137 complete and 0 interrupted iterations
load_test  ✓ [ 100% ] 00/50 VUs    50s
spike_test   [  10% ] 039/100 VUs  02.0s/20.0s

running (0m58.0s), 059/150 VUs, 304873 complete and 0 interrupted iterations
load_test  ✓ [ 100% ] 00/50 VUs    50s
spike_test   [  15% ] 059/100 VUs  03.0s/20.0s

running (0m59.0s), 079/150 VUs, 311067 complete and 0 interrupted iterations
load_test  ✓ [ 100% ] 00/50 VUs    50s
spike_test   [  20% ] 079/100 VUs  04.0s/20.0s

running (1m00.0s), 099/150 VUs, 312360 complete and 0 interrupted iterations
load_test  ✓ [ 100% ] 00/50 VUs    50s
spike_test   [  25% ] 099/100 VUs  05.0s/20.0s

running (1m01.0s), 100/150 VUs, 316525 complete and 0 interrupted iterations
load_test  ✓ [ 100% ] 00/50 VUs    50s
spike_test   [  30% ] 100/100 VUs  06.0s/20.0s

running (1m02.0s), 100/150 VUs, 322270 complete and 0 interrupted iterations
load_test  ✓ [ 100% ] 00/50 VUs    50s
spike_test   [  35% ] 100/100 VUs  07.0s/20.0s

running (1m03.0s), 100/150 VUs, 327675 complete and 0 interrupted iterations
load_test  ✓ [ 100% ] 00/50 VUs    50s
spike_test   [  40% ] 100/100 VUs  08.0s/20.0s

running (1m04.0s), 100/150 VUs, 333453 complete and 0 interrupted iterations
load_test  ✓ [ 100% ] 00/50 VUs    50s
spike_test   [  45% ] 100/100 VUs  09.0s/20.0s

running (1m05.0s), 100/150 VUs, 339243 complete and 0 interrupted iterations
load_test  ✓ [ 100% ] 00/50 VUs    50s
spike_test   [  50% ] 100/100 VUs  10.0s/20.0s

running (1m06.0s), 100/150 VUs, 344957 complete and 0 interrupted iterations
load_test  ✓ [ 100% ] 00/50 VUs    50s
spike_test   [  55% ] 100/100 VUs  11.0s/20.0s

running (1m07.0s), 100/150 VUs, 350949 complete and 0 interrupted iterations
load_test  ✓ [ 100% ] 00/50 VUs    50s
spike_test   [  60% ] 100/100 VUs  12.0s/20.0s

running (1m08.0s), 100/150 VUs, 356713 complete and 0 interrupted iterations
load_test  ✓ [ 100% ] 00/50 VUs    50s
spike_test   [  65% ] 100/100 VUs  13.0s/20.0s

running (1m09.0s), 100/150 VUs, 361979 complete and 0 interrupted iterations
load_test  ✓ [ 100% ] 00/50 VUs    50s
spike_test   [  70% ] 100/100 VUs  14.0s/20.0s

running (1m10.0s), 100/150 VUs, 367592 complete and 0 interrupted iterations
load_test  ✓ [ 100% ] 00/50 VUs    50s
spike_test   [  75% ] 100/100 VUs  15.0s/20.0s

running (1m11.0s), 081/150 VUs, 373581 complete and 0 interrupted iterations
load_test  ✓ [ 100% ] 00/50 VUs    50s
spike_test   [  80% ] 081/100 VUs  16.0s/20.0s

running (1m12.0s), 061/150 VUs, 379562 complete and 0 interrupted iterations
load_test  ✓ [ 100% ] 00/50 VUs    50s
spike_test   [  85% ] 061/100 VUs  17.0s/20.0s

running (1m13.0s), 041/150 VUs, 385342 complete and 0 interrupted iterations
load_test  ✓ [ 100% ] 00/50 VUs    50s
spike_test   [  90% ] 041/100 VUs  18.0s/20.0s

running (1m14.0s), 021/150 VUs, 391220 complete and 0 interrupted iterations
load_test  ✓ [ 100% ] 00/50 VUs    50s
spike_test   [  95% ] 021/100 VUs  19.0s/20.0s

running (1m15.0s), 001/150 VUs, 396415 complete and 0 interrupted iterations
load_test  ✓ [ 100% ] 00/50 VUs    50s
spike_test   [ 100% ] 001/100 VUs  20.0s/20.0s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<500' p(95)=1.14ms
    ✓ 'p(99)<1000' p(99)=3.23ms

    login_latency
    ✓ 'p(95)<300' p(95)=1.1444

    profile_latency
    ✓ 'p(95)<200' p(95)=0


  █ TOTAL RESULTS 

    checks_total.......: 792900 10571.403533/s
    checks_succeeded...: 50.00% 396456 out of 792900
    checks_failed......: 49.99% 396444 out of 792900

    ✗ login status 200
      ↳  0% — ✓ 20 / ✗ 396430
    ✗ login < 500ms
      ↳  99% — ✓ 396436 / ✗ 14

    CUSTOM
    login_failures.................: 396444 5285.621771/s
    login_latency..................: avg=0.518796 min=0        med=0.272    max=956.8919 p(90)=1.0014   p(95)=1.1444  
    profile_latency................: avg=0        min=0        med=0        max=0        p(90)=0        p(95)=0       

    HTTP
    http_req_duration..............: avg=518.79µs min=0s       med=272µs    max=956.89ms p(90)=1ms      p(95)=1.14ms  
      { expected_response:true }...: avg=641.82ms min=395.75ms med=720.47ms max=956.89ms p(90)=827.89ms p(95)=860.32ms
    http_req_failed................: 99.99% 396432 out of 396452
    http_reqs......................: 396452 5285.728432/s

    EXECUTION
    iteration_duration.............: avg=723.67µs min=0s       med=633.7µs  max=958.89ms p(90)=1.09ms   p(95)=1.44ms  
    iterations.....................: 396450 5285.701767/s
    vus............................: 1      min=0                max=100
    vus_max........................: 150    min=150              max=150

    NETWORK
    data_received..................: 175 MB 2.3 MB/s
    data_sent......................: 76 MB  1.0 MB/s



running (1m15.0s), 000/150 VUs, 396450 complete and 0 interrupted iterations
load_test  ✓ [ 100% ] 00/50 VUs    50s
spike_test ✓ [ 100% ] 000/100 VUs  20s